# Taps
tap "homebrew/versions"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "grpc/grpc"
tap "brewsci/base"
tap "libsql/sqld"
tap "tursodatabase/tap"

# Development
brew "llvm"
brew "gcc", args: ["without-multilib"]
brew "grpc", args: ["with-plugins"]
brew "go", args: ["cross-compile-common"]
brew "libomp"
brew "rlwrap"
brew "wget"
brew "libssh2"
brew "p7zip"
brew "libxml2"
brew "jq"
brew "jenv"
brew "rbenv"
brew "pyenv"
brew "nvm"
brew "yarn"
brew "cookiecutter"
brew "heroku"
brew "awscli"
brew "bun"
brew "docker"
brew "docker-compose"
brew "zig"

# Elasticsearch and related tools
brew "elasticsearch"
brew "apm-server"
brew "filebeat"
brew "kibana"

# Databases
brew "postgresql"
brew "mongodb"
brew "mariadb"
brew "cassandra"
brew "presto"
brew "redis"
brew "turso"

# Python and related packages
brew "python3"
brew "numpy"
brew "opencv3"
brew "protobuf"
brew "boost-python3"
brew "tesseract", args: ['HEAD']
brew "apache-arrow"

# Document processing and related packages
brew "pandoc"
brew "pandoc-citeproc"
brew "jpeg"
brew "libpng"
brew "libtiff"
brew "openexr"
cask "mactex"

# R and related packages
brew "R"
brew "rstudio-server"
brew "libxml2"
brew "udunits"
brew "libgit2"
brew "tcl-tk"
brew "libomp"

# Mac App Store command line
brew "mas"

# Casks: Fonts
cask "font-victor-mono"

# Casks: Development
cask "couchbase-server-community"
cask "google-cloud-sdk"
cask "podman"
cask "podman-desktop"
cask "virtualbox"
cask "zed"
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "pycharm-ce"
cask "pgadmin4"
cask "insomnia"

# Casks: Design
cask "figma"
cask "blender"
cask "miro"
cask "sketchup"

# Casks: Communication
cask "slack"
cask "discord"

# Casks: Multimedia
cask "handbrake"
cask "vlc"
cask "rstudio"

# Casks: Browsers
#cask "google-chrome"
cask "firefox"
cask "opera-developer"
cask "arc"

# Casks: Utilities
cask "calibre"
cask "raycast"
cask "transmission"
cask "yacreader"
# Other
