# Taps
tap "grpc/grpc"
tap "brewsci/base"
tap "libsql/sqld"
tap "oven-sh/bun"

# Development
brew "spaceship"
brew "llvm"
#brew "gcc", args: ["without-multilib"]
#brew "grpc", args: ["with-plugins"]
brew "libomp"
brew "rlwrap"
brew "wget"
brew "libssh2"
brew "p7zip"
brew "libxml2"
brew "jq"
brew "jenv"
brew "rbenv"
brew "pyenv"
brew "nvm"
brew "cookiecutter"
brew "awscli"
brew "bun"
brew "pnpm"
brew "docker"
brew "docker-compose"
brew "zig"
brew "rust"
brew "kind"

# Databases
brew "postgresql@17"
brew "mariadb"
brew "cassandra"
brew "prestodb"
brew "redis"

# Python and related packages
brew "python3"
brew "numpy"
brew "opencv"
brew "protobuf"
brew "boost-python3"
brew "tesseract", args: ['HEAD']
brew "apache-arrow"

# Document processing and related packages
brew "pandoc"
#brew "pandoc-citeproc"
brew "jpeg"
brew "libpng"
brew "libtiff"
brew "openexr"
cask "mactex"

# R and related packages
brew "R"
#brew "rstudio-server"
brew "libxml2"
brew "udunits"
brew "libgit2"
brew "tcl-tk"
brew "libomp"
brew "openblas"

# Required for postgresql
brew "libpq"
brew "postgis"

# Mac App Store command line
brew "mas"

# Casks: Fonts
cask "font-victor-mono"
cask "font-fira-code-nerd-font"
cask "font-handlee"
cask "font-montserrat"
cask "font-montserrat-alternates"
cask "font-sf-mono"

# Casks: Development
cask "couchbase-server-community"
cask "google-cloud-sdk"
cask "podman-desktop"

# Casks: Editors
cask "zed"
cask "visual-studio-code"
#cask "intellij-idea-ce"
#cask "pycharm-ce"
cask "pgadmin4"
cask "insomnia"

# Casks: Design
cask "figma"
cask "blender"
cask "miro"
cask "sketchup"

# Casks: Communication
cask "slack"
cask "discord"

# Casks: Multimedia
cask "handbrake"
cask "vlc"
cask "rstudio"

# Casks: Browsers
cask "google-chrome"
cask "firefox"
cask "opera-developer"

# Casks: Utilities
cask "calibre"
cask "raycast"
cask "transmission"
cask "yacreader"
cask "tableplus"
cask "jdownloader"

# AI
cask "ollama"
cask "amazon-q"
